applications/test/coupledFvPatch/testFullMatching/lift/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.orig;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left1
    {
        type            noSlip;
    }
    right1
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    walls1
    {
        type            noSlip;
    }
    left2
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    right2
    {
        type            zeroGradient;
    }
    walls2
    {
        type            noSlip;
    }
    lift
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
