applications/test/coupledFvPatch/testFullMatching/lift/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left1
    {
        type            slip;
    }
    right1
    {
        //type            cyclicAMI;
        //value           uniform (0 0 0);
        type            slip;
        patchType       cyclicAMI;
        value           uniform (0 0 0);
    }
    walls1
    {
        type            slip;
    }
    left2
    {
        //type            cyclicAMI;
        type            slip;
        patchType       cyclicAMI;
        value           uniform (0 0 0);
    }
    right2
    {
        type            slip;
    }
    walls2
    {
        type            slip;
    }
    lift
    {
        type            uniformFixedValue;
        uniformValue    table
        (
            (0  (0 0 0))
            (0.1  (0 -1 0))
        );
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
